Repository: nhanhkimson/005_NHANH_KIMSON_HOMEWORK_IOS_003
Catalog: E-commerce/Resources/Localization/*.lproj/Localizable.strings
Languages: km, ko

# version_label
source: Version: %@
km: កំណែ: %@
ko: 버전: %@

source: Error
km: កំហុស
ko: 오류

source: Set Special
km: កំណត់ពិសេស
ko: 스페셜 설정

# change_special_schedule
source: Change Schedule
km: ប្តូរកាលវិភាគ
ko: 일정 변경

source: Home
km: ទំព័រដើម
ko: 홈

source: Attendance
km: វត្តមាន
ko: 출석

source: Request
km: សំណើរ
ko: 요청

source: Notification
km: សារដំណឹង
ko: 알림

source: Profile
km: ពត៌មានផ្ទាល់ខ្លួន
ko: 프로필

# welcome_message
source: Welcome to the app!
km: សូមស្វាគមន៍
ko: 앱에 오신 것을 환영합니다!

# edit_button
source: Edit
km: កែប្រែ
ko: 편집

source: Done
km: រួចរាល់
ko: 완료

# distance_to_school_message
source: You are %@ outside the allowed range.
km: អ្នកនៅចម្ងាយ %@ ខាងក្រៅតំបន់ដែលបានអនុញ្ញាត។
ko: 허용된 범위를 %@ 벗어났습니다.

source: Welcom Back, Admin
km: សូមស្វាគមន៍​​ Admin
ko: 다시 오신 것을 환영합니다, Admin

source: Attendance Management Dashboard
km: ផ្ទាំងគ្រប់គ្រងវត្តមាន
ko: 출석 관리 대시보드

source: All Status
km: ស្ថានភាពទាំងអស់
ko: 모든 상태

source: Early Leave
km: ចាកចេញមុនពេល
ko: 조퇴

source: IT Instructor
km: គ្រូបង្រៀនវិស័យព័ត៌មានវិទ្យា
ko: IT 강사

source: Class PVH
km: ថ្នាក់ PVH
ko: PVH 반

source: Statistic
km: ស្ថិតិ
ko: 통계

source: Credit Attendance
km: វត្តមានក្រេឌីត
ko: 출석 학점

source: Your attitude score
km: ពិន្ទុអាកប្បកិរិយារបស់អ្នក
ko: 당신의 태도 점수는

source: Attendance Summary
km: សង្ខេបវត្តមាន
ko: 출석 요약

source: Extra Activity
km: សកម្មភាពបន្ថែម
ko: 추가 활동

source: Date
km: កាលបរិច្ឆេទ
ko: 날짜

source: Swipe to Check In
km: អូសទៅស្តាំដើម្បី Check-In
ko: 스와이프하여 출근

source: Group Leader
km: មេក្រុម
ko: 그룹 리더

source: Attendee
km: អ្នកចូលរួម
ko: 참석자

source: Type
km: ប្រភេទ
ko: 유형

source: Swipe to Check Out
km: អូសទៅស្តាំដើម្បីចេញពីការងារ
ko: 스와이프하여 퇴근

source: Join Overtime
km: ចូលរួមថែមម៉ោង
ko: 초과 근무 참여

source: Pending
km: កំពុងរង់ចាំ
ko: 대기 중

source: Student Name
km: ឈ្មោះសិស្ស
ko: 학생 이름

source: Class
km: ថ្នាក់
ko: 수업

source: Start from
km: ចាប់ផ្តើមពី
ko: 시작일

source: End at
km: បញ្ចប់នៅ
ko: 종료일

source: Duration
km: រយៈពេល
ko: 기간

source: Today Student’s Attendance
km: វត្តមានសិស្សថ្ងៃនេះ
ko: 오늘 학생 출석

source: Request Permission
km: ស្នើសុំការអនុញ្ញាត
ko: 허가 요청

source: Reason
km: មូលហេតុ
ko: 사유

source: Shift
km: វេន
ko: 근무조

# today_staff_attendance
source: Today Staff's Attendance
km: វត្តមានបុគ្គលិកថ្ងៃនេះ
ko: 오늘 직원 출석

source: Today Request Permission
km: សំណើសុំការអនុញ្ញាតនៅថ្ងៃនេះ
ko: 오늘 허가를 요청합니다

source: Present
km: វត្តមាន
ko: 출석

source: Late
km: យឺត
ko: 지각

source: Absent
km: អវត្តមាន
ko: 결석

source: Total Attendance
km: វត្តមានសរុប
ko: 총 출석 수

source: Your attendance
km: វត្តមានរបស់អ្នក
ko: 당신의 출석

source: Updated
km: បានធ្វើបច្ចុប្បន្នភាព
ko: 업데이트됨

# instructor_name
source: Instractor Name
km: ឈ្មោះគ្រូបង្រៀន
ko: 강사 이름

source: Complet Overtime
km: បញ្ចប់ម៉ោងបន្ថែម
ko: 초과근무 완료

source: Start Time
km: ពេលចាប់ផ្តើម
ko: 시작 시간

source: List Attendance
km: បញ្ជីវត្តមាន
ko: 출석 목록

source: Track your attendance record and statistics
km: តាមដានកំណត់ត្រា និងស្ថិតិវត្តមានរបស់អ្នក
ko: 출석 기록과 통계를 추적하세요

source: Date filter
km: Filter កាលបរិច្ឆេទ
ko: 날짜 필터

source: Summary
km: សង្ខេប
ko: 요약

source: Recent history
km: ប្រវត្តិថ្មីៗ
ko: 최근 기록

source: total records
km: ចំនួនកំណត់ត្រាសរុប
ko: 총 기록 수

source: total record
km: ចំនួនកំណត់ត្រាសរុប
ko: 총 기록

source: All
km: ទាំងអស់
ko: 전체

source: Select month
km: ជ្រើសរើសខែ
ko: 월 선택

source: Clear
km: សម្អាត
ko: 지우기

source: Search anything...
km: ស្វែងរក...
ko: 아무거나...

source: No Attendance Found
km: មិនមានវត្តមាន
ko: 출석이 없습니다

# data_will_show_if_exists
source: Data will show if it exists
km: ទិន្នន័យនឹងបង្ហាញប្រសិនបើវាមាន
ko: 데이터가 존재하면 표시됩니다

source: Filter by :
km: Filter ដោយ:
ko: 필터 기준 :

source: Reset
km: កំណត់ឡើងវិញ
ko: 재설정

source: Role of User
km: តួនាទីអ្នកប្រើ
ko: 사용자 역할

source: Date Range
km: Range ថ្ងៃខែ
ko: 기간 범위

source: Select Start Date
km: ជ្រើសរើសថ្ងៃចាប់ផ្តើម
ko: 시작 날짜 선택

source: Select End Date
km: ជ្រើសរើសថ្ងៃបញ្ចប់
ko: 종료 날짜 선택

source: Department
km: ដេប៉ាតឺម៉ង់
ko: 부서

source: Select department
km: ជ្រើសរើសដេប៉ាតឺម៉ង់
ko: 부서 선택

source: Select class
km: ជ្រើសរើសថ្នាក់
ko: 반 선택

source: Status
km: ស្ថានភាព
ko: 상태

source: Select Status
km: ជ្រើសរើសស្ថានភាព
ko: 상태 선택

source: Apply Filters
km: អនុវត្ត Filters
ko: 필터 적용

# please_select_date
source: Select date
km: ជ្រើសកាលបរិច្ឆេទ
ko: 날짜 선택

source: Reset All
km: កំណត់ឡើងវិញទាំងអស់
ko: 모두 재설정

source: Staff
km: បុគ្គលិក
ko: 직원

source: Student
km: សិស្ស
ko: 학생

# check_in_and_check_out
source: Check-in & Check-out
km: ស្កេនចូល & ស្កេនចេញ
ko: 출근 & 퇴근

# course_time_and_privacy
source: Course Time and Activity
km: ម៉ោងនិងសកម្មភាពនៃវគ្គសិក្សា
ko: 강의 시간 및 활동

source: Select
km: ជ្រើសរើស
ko: 선택해요

source: Khmer
km: ខ្មែរ
ko: 크메르어

source: English
km: អង់គ្លេស
ko: 영어

source: Korean
km: កូរ៉េ
ko: 한국어

# please_select_a_display_languages
source: Please select a display language
km: សូមជ្រើសរើសភាសាបង្ហាញ
ko: 표시 언어를 선택하세요

source: Languages
km: ភាសា
ko: 언어

source: Push Notification
km: ការជូនដំណឹង
ko: 푸시 알림

source: Allow permission to get more information
km: អនុញ្ញាតឱ្យការអនុញ្ញាតដើម្បីទទួលបានព័ត៌មានបន្ថែម
ko: 더 많은 정보를 받으려면 권한을 허용하세요

source: Settings
km: ការកំណត់
ko: 설정

source: Choose your preferred language
km: ជ្រើសរើសភាសាដែលអ្នកចូលចិត្ត
ko: 선호하는 언어를 선택하세요

source: Change Password
km: ប្តូរពាក្យសម្ងាត់
ko: 비밀번호 변경

source: You can change your current password
km: អ្នកអាចប្តូរពាក្យសម្ងាត់បច្ចុប្បន្នរបស់អ្នកបាន
ko: 현재 비밀번호를 변경할 수 있습니다

source: Logout
km: ចាកចេញ
ko: 로그아웃

source: Appearance
km: រូបរាង
ko: 모양

# appearance_description
source: Customize the look and feel of the app
km: ប្ដូររាងនិងអារម្មណ៍នៃកម្មវិធី
ko: 앱의 모양과 느낌을 사용자 지정

# student_info
source: Staff profile information is managed by school administration. contact your school office fore any updated needed.
km: ព័ត៌មានអំពីប្រវត្តិរូបបុគ្គលិកត្រូវបានគ្រប់គ្រងដោយរដ្ឋបាលសាលា។ ទាក់ទងការិយាល័យសាលារបស់អ្នក សម្រាប់ការធ្វើបច្ចុប្បន្នភាពណាមួយដែលត្រូវការ។
ko: 직원 프로필 정보는 학교 행정 부서에서 관리합니다. 필요한 업데이트가 있으면 학교 사무실에 문의하세요.

# staff_info
source: Staff profile information is managed by school administration. Contact your school office for any updates needed.
km: ព័ត៌មានប្រវត្តិរូបបុគ្គលិកត្រូវបានគ្រប់គ្រងដោយការិយាល័យរដ្ឋបាលសាលា។ សូមទាក់ទងការិយាល័យសាលារបស់អ្នក ប្រសិនបើត្រូវការធ្វើបច្ចុប្បន្នភាព។
ko: 직원 프로필 정보는 학교 행정실에서 관리합니다. 수정이 필요한 경우 학교 사무실에 문의하세요.

# are_you_sure_to_logout
source: Are you sure you want to log out?
km: តើអ្នកចង់ចេញពីគណនីមែនទេ?
ko: 로그아웃하시겠습니까?

# this_will_remove_all_your_cache_data
source: This will remove all your cached data.
km: នេះនឹងលុបចោលទិន្នន័យឃ្លាំងសម្ងាត់ទាំងអស់របស់អ្នក។
ko: 캐시된 모든 데이터가 삭제됩니다.

source: Confirm
km: បញ្ជាក់
ko: 확인

source: OK
km: យល់ព្រម
ko: 확인

source: Cancel
km: បោះបង់
ko: 취소

source: Are you sure you want to disable push notifications?
km: តើអ្នកប្រាកដថាចង់បិទការជូនដំណឹងផុសដែរឬទេ?
ko: 푸시 알림을 비활성화하시겠습니까?

source: Policy
km: គោលការណ៍
ko: 정책

source: Check-In/Check-Out Rules
km: ច្បាប់ចូលរៀន និងចេញរៀន
ko: 출석 및 퇴실 규칙

source: Information of attendance policies
km: ព័ត៌មានអំពីគោលការណ៍វត្តមាន
ko: 출석 정책에 대한 정보

source: Students must check in before 8:01 AM. Late check-in after this time will be marked as late.
km: សិស្សត្រូវតែចូលរៀនមុនម៉ោង ៨:០១ ព្រឹក។ ប្រសិនបើចូលរៀនក្រោយម៉ោងនេះ នឹងត្រូវចាត់ទុកថាមកយឺត។
ko: 학생은 오전 8시 1분 이전에 출석해야 합니다. 이후 출석은 지각으로 표시됩니다.

source: Check-out is only allowed after 5:00 PM for Monday-Friday. Early check-out requires permission.
km: ការចេញរៀនអនុញ្ញាតតែបន្ទាប់ពីម៉ោង ៥ ល្ងាច ពីថ្ងៃច័ន្ទដល់ថ្ងៃសុក្រ។ ប្រសិនបើចេញមុនត្រូវការការអនុញ្ញាត។
ko: 월요일부터 금요일까지 퇴실은 오후 5시 이후에만 가능합니다. 조기 퇴실은 허가가 필요합니다.

source: If check-out occurs before 5:00 PM, it will be marked as early leave.
km: ប្រសិនបើចេញមុនម៉ោង ៥ ល្ងាច នឹងត្រូវចាត់ទុកថាចេញមុនម៉ោង។
ko: 오후 5시 이전에 퇴실하면 조퇴로 표시됩니다.

source: Behavior Policy
km: គោលការណ៍អំពីអាកប្បកិរិយា
ko: 행동 규칙

source: Conduct and classroom behavior rules.
km: ច្បាប់អំពីអាកប្បកិរិយានិងវិន័យក្នុងថ្នាក់។
ko: 태도와 교실 내 행동에 대한 규칙입니다.

source: Disrespect deducts 0.7 points.
km: ការមិនគោរពនឹងកាត់ពិន្ទុ ០.៧។
ko: 무례한 행동은 0.7점을 감점합니다.

source: Disrupting class deducts 0.4 points.
km: ការរំខានក្នុងថ្នាក់នឹងកាត់ពិន្ទុ ០.៤។
ko: 수업 방해는 0.4점을 감점합니다.

source: Bullying results in suspension.
km: ការរំលោភបំពាននឹងត្រូវផ្អាកការសិក្សា។
ko: 괴롭힘은 정학 처분을 받습니다.

source: Failure to comply results in a warning.
km: ការមិនគោរពនឹងទទួលបានសេចក្តីព្រមាន។
ko: 규칙 위반 시 경고를 받습니다.

source: Fighting results in expulsion.
km: ការប្រយុទ្ធគ្នានឹងត្រូវបណ្តេញចេញពីសាលា។
ko: 싸움은 퇴학 조치됩니다.

source: Leave Request Guideline
km: ការណែនាំស្នើសុំច្បាប់ឈប់សម្រាក
ko: 휴가 신청 지침

source: Guidelines for submitting leave requests.
km: ការណែនាំសម្រាប់ការស្នើសុំឈប់សម្រាក។
ko: 휴가 신청을 위한 지침입니다.

source: Planned absences require 48-hour advance notice via student portal.
km: ការឈប់សម្រាកដែលបានគ្រោងទុកត្រូវជូនដំណឹងជាមុន ៤៨ ម៉ោងតាមរយៈប្រព័ន្ធសិស្ស។
ko: 계획된 결석은 학생 포털을 통해 48시간 전에 미리 신고해야 합니다.

source: Medical appointments require documentation.
km: ការឈប់សម្រាកដោយហេតុផលសុខភាពត្រូវមានឯកសារបញ្ជាក់។
ko: 의료 사유의 경우 증빙 서류가 필요합니다.

source: Project deadlines may be extended for documented absences.
km: កាលកំណត់គម្រោងអាចពន្យារបាន ប្រសិនបើមានឯកសារបញ្ជាក់។
ko: 증빙된 결석의 경우 프로젝트 마감일이 연장될 수 있습니다.

source: Overtime & Go Outside
km: ម៉ោងបន្ថែម និងការចេញក្រៅ
ko: 야간 학습 및 외출 규정

source: Guidelines for overtime study and outdoor permission.
km: ការណែនាំសម្រាប់ការរៀនបន្ថែម និងការចេញក្រៅសាលា។
ko: 야간 학습 및 외출 허가에 대한 지침입니다.

source: Weekday: Extra research classes are from 6:00 PM to 8:30 PM.
km: ថ្ងៃធ្វើការ៖ ថ្នាក់ស្រាវជ្រាវបន្ថែមមានចាប់ពីម៉ោង ៦ ល្ងាច ដល់ម៉ោង ៨:៣០ ល្ងាច។
ko: 평일: 추가 연구 수업은 오후 6시부터 8시 30분까지입니다.

source: No hats indoors.
km: មិនអនុញ្ញាតពាក់មួកនៅក្នុងថ្នាក់។
ko: 교실 내 모자 착용 금지.

source: No extreme hairstyles allowed.
km: មិនអនុញ្ញាតសក់ដែលមានរចនាបថខុសប្រក្រតី។
ko: 과도한 헤어스타일 금지.

source: No sunglasses indoors.
km: មិនអនុញ្ញាតពាក់វ៉ែនតាផ្តល់ពន្លឺក្នុងថ្នាក់។
ko: 교실 내 선글라스 착용 금지.

source: No makeup in class.
km: មិនអនុញ្ញាតលាបមុខនៅក្នុងថ្នាក់។
ko: 수업 중 화장 금지.

source: Attendance Consequences & Warning
km: វិធានការវត្តមាន និងសេចក្តីព្រមាន
ko: 출석 관련 조치 및 경고

source: Consequences related to attendance and warnings.
km: វិធានការទាក់ទងនឹងវត្តមាន និងការព្រមាន។
ko: 출석 및 경고에 대한 조치 사항입니다.

source: Being late will deduct 0.75 points.
km: ការមកយឺតនឹងកាត់ពិន្ទុ ០.៧៥។
ko: 지각 시 0.75점 감점됩니다.

source: Taking leave will deduct 1 point.
km: ការឈប់សម្រាកនឹងកាត់ពិន្ទុ ១។
ko: 결석 시 1점 감점됩니다.

source: Leaving early or going outside under 2 hours deducts 0.5 points; over 2 hours deducts 1 point.
km: ចេញមុន ឬចេញក្រៅក្រោម ២ ម៉ោងនឹងកាត់ពិន្ទុ ០.៥; លើសពី ២ ម៉ោងនឹងកាត់ពិន្ទុ ១។
ko: 2시간 이하 조퇴 또는 외출 시 0.5점, 2시간 초과 시 1점 감점됩니다.

source: Warning in 1/3 subjects in the same month reduces allowance by 50%.
km: ប្រសិនបើមានសេចក្តីព្រមានក្នុងមុខវិជ្ជា ១/៣ ក្នុងខែតែមួយ នឹងកាត់ប្រាក់ឧបត្ថម្ភ ៥០%។
ko: 한 달 동안 1/3 과목에서 경고를 받으면 수당이 50% 삭감됩니다.

source: Warning in 2/3 subjects in the same month reduces allowance by 100%.
km: ប្រសិនបើមានសេចក្តីព្រមានក្នុងមុខវិជ្ជា ២/៣ ក្នុងខែតែមួយ នឹងកាត់ប្រាក់ឧបត្ថម្ភ ១០០%។
ko: 한 달 동안 2/3 과목에서 경고를 받으면 수당이 100% 삭감됩니다.

source: Warning in 3/3 subjects in the same month results in loss of scholarship.
km: ប្រសិនបើមានសេចក្តីព្រមានក្នុងមុខវិជ្ជា ៣/៣ ក្នុងខែតែមួយ នឹងបាត់បង់អាហារូបករណ៍។
ko: 한 달 동안 3/3 과목에서 경고를 받으면 장학금이 취소됩니다.

source: Login here
km: ចូលនៅទីនេះ
ko: 여기에서 로그인하세요

source: Welcome back you’ve been missed!
km: សូមស្វាគមន៍ការវិលត្រឡប់មកវិញ យើងបាននឹកអ្នក!

source: Email
km: អ៊ីមែល
ko: 이메일

source: Password
km: ពាក្យសម្ងាត់
ko: 비밀번호

source: Forgot Password
km: ភ្លេចពាក្យសម្ងាត់ឬ?
ko: 비밀번호를 잊으셨나요?

source: Logging in...
km: កំពុងចូល...
ko: 로그인 중...

source: Login
km: ចូល
ko: 로그인

source: Please enter your email to reset the password.
km: សូមបញ្ចូលអ៊ីមែលរបស់អ្នកដើម្បីកំណត់ពាក្យសម្ងាត់ឡើងវិញ។
ko: 비밀번호를 재설정하려면 이메일을 입력하세요.

source: Reset Password
km: កំណត់ពាក្យសម្ងាត់ឡើងវិញ
ko: 비밀번호 재설정

source: Your Email
km: អ៊ីមែលរបស់អ្នក
ko: 당신의 이메일

# reset_link_message
source: We sent a reset link to hello@example.com. Enter the 6-digit code mentioned in the email.
km: យើងបានផ្ញើតំណភ្ជាប់សម្រាប់កំណត់ពាក្យសម្ងាត់ឡើងវិញទៅកាន់ hello@example.com។ សូមបញ្ចូលលេខកូដចំនួន ៦ ខ្ទង់ដែលមាននៅក្នុងអ៊ីមែល។
ko: hello@example.com 으로 재설정 링크를 보냈습니다. 이메일에 적힌 6자리 코드를 입력하세요.

source: Check your email
km: ពិនិត្យអ៊ីមែលរបស់អ្នក
ko: 이메일을 확인하세요

# create_new_password_instructions
source: Create a new password. Ensure it differs from previous ones for security.
km: បង្កើតពាក្យសម្ងាត់ថ្មី។ សូមប្រាកដថាវខុសពីពាក្យសម្ងាត់មុនសម្រាប់សុវត្ថិភាព។
ko: 새 비밀번호를 생성하세요. 이전 비밀번호와 다르게 설정하여 보안을 유지하세요.

# set_new_password
source: Set a new password
km: កំណត់ពាក្យសម្ងាត់ថ្មី
ko: 새 비밀번호 설정

source: Update Password
km: ធ្វើបច្ចុប្បន្នភាពពាក្យសម្ងាត់
ko: 비밀번호 업데이트

source: Confirm Password
km: បញ្ជាក់ពាក្យសម្ងាត់
ko: 비밀번호 확인

source: January
km: មករា
ko: 1월

source: February
km: កុម្ភៈ
ko: 2월

source: March
km: មីនា
ko: 3월

source: April
km: មេសា
ko: 4월

source: May
km: ឧសភា
ko: 5월

source: June
km: មិថុនា
ko: 6월

source: July
km: កក្ដដា
ko: 7월

source: August
km: សីហា
ko: 8월

source: September
km: កញ្ញា
ko: 9월

source: October
km: តុលា
ko: 10월

source: November
km: វិច្ឆិកា
ko: 11월

source: December
km: ធ្នូ
ko: 12월

source: Mon
km: ចន្ទ
ko: 월

source: Tue
km: អង្គារ
ko: 화

source: Wed
km: ពុធ
ko: 수

source: Thu
km: ព្រហ
ko: 목

source: Fri
km: សុក្រ
ko: 금

source: Sat
km: សៅរ៍
ko: 토

source: Sun
km: អាទិត្យ
ko: 일

source: Permission
km: សុំច្បាប់
ko: 허가

source: Miss scan
km: ខកខានស្កេន
ko: 스캔 누락

source: On Time
km: ទាន់ពេលវេលា
ko: 정시

source: Check In
km: ស្កេនចូល
ko: 출근

source: Check Out
km: ស្កេនចេញ
ko: 퇴근

source: Early Check-Out
km: ស្កេនចេញមុនពេល
ko: 조기 퇴근

source: Miss Check-in
km: ខកខានស្កេនចូល
ko: 출근 누락

source: Miss Check-Out
km: ខកខានស្កេនចេញ
ko: 퇴근 누락

source: Leave Early
km: ចាកចេញមុន
ko: 조기 퇴근

source: Outside
km: ចេញក្រៅ
ko: 외출

source: Miss Check
km: ខកខានការស្កេន
ko: 점검 누락

source: Overtime
km: ម៉ោងបន្ថែម
ko: 초과 근무

source: Make every minute count.
km: ធ្វើឱ្យរាល់នាទី មានតម្លៃ។
ko: 매분을 소중히 여기세요.

source: Monitor your attendance and stay consistent with your learning goals.
km: តាមដានវត្តមានរបស់អ្នក និងរក្សាភាពស្ថិរភាពជាមួយគោលដៅសិក្សារបស់អ្នក។
ko: 출석을 모니터링하고 학습 목표와 일관성을 유지하세요.

source: Old Password
km: ពាក្យសម្ងាត់ចាស់
ko: 기존 비밀번호

source: New Password
km: ពាក្យសម្ងាត់ថ្មី
ko: 새 비밀번호

source: Loading...
km: កំពុងផ្ទុក...
ko: 로딩 중...

source: Something went wrong
km: មានអ្វីមួយខុស
ko: 문제가 발생했습니다

source: Close
km: បិទ
ko: 닫기

source: Haven't got the email yet?
km: មិនទាន់បានអ៊ីមែលទេ?
ko: 아직 이메일을 받지 못하셨나요?

source: Select Time
km: ជ្រើសរើសពេលវេលា
ko: 시간 선택

source: Select Date
km: ជ្រើសរើសកាលបរិច្ឆេទ
ko: 날짜 선택

source: Done
km: រួចរាល់
ko: 완료

source: Select Category
km: ជ្រើសរើសប្រភេទ
ko: 카테고리 선택

source: Shift
km: វេន
ko: 근무조

source: Brief Reason
km: មូលហេតុខ្លី
ko: 간단한 사유

source: Submit Request
km: ដាក់ស្នើសំណើ
ko: 요청 제출

source: Overtime Request
km: សំណើម៉ោងបន្ថែម
ko: 초과 근무 요청

source: Submit a request to access your location
km: ដាក់ស្នើសំណើដើម្បីចូលប្រើទីតាំងរបស់អ្នក
ko: 위치 접근을 위한 요청을 제출하세요

source: Request Information
km: ព័ត៌មានសំណើ
ko: 요청 정보

source: Request Type
km: ប្រភេទសំណើ
ko: 요청 유형

source: Edit
km: កែប្រែ
ko: 편집

source: Delete
km: លុប
ko: 삭제

source: Overtime Information
km: ព័ត៌មានម៉ោងបន្ថែម
ko: 초과 근무 정보

source: Monthly Leave Status
km: ស្ថានភាពឈប់សម្រាកប្រចាំខែ
ko: 월별 휴가 현황

source: Used this month: (permission)
km: បានប្រើក្នុងខែនេះ: (permission)
ko: 이번 달 사용: (permission)

source: Remaining before warning: (warning)
km: នៅសល់មុនព្រមាន: (warning)
ko: 경고 전 남은 횟수: (warning)

source: Approved
km: បានអនុម័ត
ko: 승인됨

# 4 Attendaces
source: 4 Attendances
km: វត្តមាន ៤
ko: 4회 출석

source: Stand By Instructor
km: គ្រូបង្រៀនរង់ចាំ
ko: 대기 강사

source: Start from
km: ចាប់ផ្តើមពី
ko: 시작일

source: Date
km: កាលបរិច្ឆេទ
ko: 날짜

source: End at
km: បញ្ចប់នៅ
ko: 종료일

source: Member
km: សមាជិក
ko: 멤버

source: Status
km: ស្ថានភាព
ko: 상태

source: Filter by
km: តម្រងដោយ
ko: 필터 기준

source: Date type
km: ប្រភេទកាលបរិច្ឆេទ
ko: 날짜 유형

source: Select date
km: ជ្រើសរើសកាលបរិច្ឆេទ
ko: 날짜 선택

source: Resend OTP
km: ផ្ញើ OTP ឡើងវិញ
ko: OTP 재전송

source: Late Arrival Policy
km: គោលការណ៍មកយឺត
ko: 지각 정책

# choose your each languages
source: Choose your language
km: ជ្រើសរើសភាសារបស់អ្នក
ko: 각 언어를 선택하세요

# Weekend: The extra class research 8:00AM - 6:00PM
source: Weekend: Extra research class 8:00 AM - 6:00 PM
km: ចុងសប្តាហ៍៖ ថ្នាក់ស្រាវជ្រាវបន្ថែម 8:00 ព្រឹក - 6:00 ល្ងាច
ko: 주말: 추가 연구 수업 08:00 - 18:00

# Student need to extra research more than 2h.
source: Students need to do extra research for more than 2 hours.
km: សិស្សត្រូវការស្រាវជ្រាវបន្ថែមលើសពី 2 ម៉ោង
ko: 학생은 2시간 이상 추가 연구가 필요합니다.

source: Under 2 hours is marked as early leave (allowed up to 6 times/month); 2 hours or more is marked as going outside.
km: ក្រោម 2 ម៉ោងត្រូវដាក់សម្គាល់ថាចេញមុន (អនុញ្ញាត 6 ដង/ខែ); 2 ម៉ោងឡើងត្រូវសម្គាល់ថាចេញក្រៅ
ko: 2시간 미만은 조퇴로 표시(월 6회 가능), 2시간 이상은 외출로 표시됩니다.

source: Invalid old password
km: ពាក្យសម្ងាត់ចាស់មិនត្រឹមត្រូវ
ko: 기존 비밀번호가 올바르지 않습니다

source: Password must include uppercase, lowercase, number (min 8 chars)
km: ពាក្យសម្ងាត់ត្រូវមានអក្សរធំ អក្សរតូច និងលេខ (យ៉ាងហោចណាស់ 8 តួអក្សរ)
ko: 비밀번호는 대문자, 소문자, 숫자를 포함해야 하며 8자 이상이어야 합니다

source: Passwords do not match
km: ពាក្យសម្ងាត់មិនត្រូវគ្នា
ko: 비밀번호가 일치하지 않습니다

source: All field are require.
km: គ្រប់វាលត្រូវតែបំពេញ
ko: 모든 필드는 필수입니다

source: Change password successfully.
km: ប្តូរពាក្យសម្ងាត់បានជោគជ័យ
ko: 비밀번호가 성공적으로 변경되었습니다

source: Set PIN
km: កំណត់លេខសម្ងាត់
ko: PIN 설정

source: Please set up a PIN to proceed
km: សូមកំណត់លេខសម្ងាត់មួយដើម្បីបន្ត
ko: 계속하려면 PIN을 설정해주세요

source: Switch to 6-digits
km: ប្ដូរទៅជា ៦ ខ្ទង់
ko: 6자리로 전환

source: Switch to 4-digits
km: ប្ដូរទៅជា ៤ ខ្ទង់
ko: 4자리로 전환

source: Enter your PIN to swipe
km: បញ្ចូលលេខសម្ងាត់របស់អ្នកដើម្បី Swipe
ko: 스와이프하려면 PIN을 입력하세요

source: Confirm Action
km: បញ្ជាក់សកម្មភាព
ko: 작업 확인

source: Are you sure to change to
km: តើអ្នកប្រាកដថាចង់ប្ដូរទៅ
ko: 변경하시겠습니까

source: Oops! No Data
km: អ៊ុប! គ្មានទិន្នន័យទេ
ko: 이런! 데이터가 없습니다

# data_will_appear_once_items_added
source: Data will appear once items are added
km: ទិន្នន័យនឹងបង្ហាញ បើមានការបន្ថែម
ko: 항목이 추가되면 데이터가 표시됩니다

source: Schedule List
km: បញ្ជីកាលវិភាគ
ko: 일정 목록

source: Success
km: ជោគជ័យ
ko: 성공

source: Name
km: ឈ្មោះ
ko: 이름

source: Schedule
km: កាលវិភាគ
ko: 시간표

source: Upload Excel
km: បញ្ចូលឯកសារ Excel
ko: 엑셀 업로드

# pin_not_match
source: PIN does not match
km: PIN មិនត្រូវគ្នា
ko: PIN이 일치하지 않습니다

source: Set New PIN
km: កំណត់ PIN ថ្មី
ko: 새 PIN 설정

# you_can_set_new_pin
source: You can set a new PIN
km: អ្នកអាចកំណត់ PIN ថ្មីបាន
ko: 새 PIN을 설정할 수 있습니다

source: Set rule
km: កំណត់ច្បាប់
ko: 규칙 설정

source: Sign out
km: ចាកចេញ
ko: 로그아웃

source: Open Settings
km: បើកការកំណត់
ko: 설정 열기

source: Notifications Disabled
km: ការជូនដំណឹងត្រូវបានបិទ
ko: 알림 비활성화됨

# notifications_disabled_message
source: Notifications are disabled for this app. Please enable them in Settings to receive reminders.
km: ការជូនដំណឹងត្រូវបានបិទសម្រាប់កម្មវិធីនេះ។ សូមបើកវានៅក្នុងការកំណត់ដើម្បីទទួលបានការរំលឹក។
ko: 이 앱의 알림이 비활성화되어 있습니다. 알림을 받으려면 설정에서 활성화하세요.

source: Set Location
km: កំណត់ទីតាំង
ko: 위치 설정

source: Change location
km: ប្តូរទីតាំង
ko: 위치 변경

source: Export as Excel
km: នាំចេញជា Excel
ko: Excel로 내보내기

source: Leave
km: ឈប់សម្រាក
ko: 휴가

source: Mark All as Read
km: សម្គាល់ទាំងអស់ថាអានរួច
ko: 모두 읽음으로 표시

source: Recently
km: ថ្មីៗនេះ
ko: 최근에

source: My Request
km: សំណើរបស់ខ្ញុំ
ko: 내 요청

source: seconds ago
km: វិនាទីមុន
ko: 몇 초 전

source: minutes ago
km: នាទីមុន
ko: 몇 분 전

source: hours ago
km: ម៉ោងមុន
ko: 몇 시간 전

source: days ago
km: ថ្ងៃមុន
ko: 며칠 전

source: weeks ago
km: សប្តាហ៍មុន
ko: 몇 주일 전에

source: Confirm Check-In
km: បញ្ជាក់ការស្កេនចូល
ko: 체크인 확인

# confirm_mark_checked_in
source: Are you sure you want to mark this user as checked in?
km: តើអ្នកប្រាកដថាចង់ផ្លាស់ប្តូរ Status អ្នកប្រើនេះថាបានស្កេនចូលរួចរាល់ហើយឬ?
ko: 이 사용자를 체크인으로 표시하시겠습니까?

source: Yes, Check In
km: បាទ/ចាស ចូល
ko: 예, 체크인

source: Confirm Check-Out
km: បញ្ជាក់ការចេញ
ko: 체크아웃 확인

# confirm_mark_checked_out
source: Are you sure you want to mark this user as checked out?
km: តើអ្នកប្រាកដថាចង់ផ្លាស់ប្តូរ Status អ្នកប្រើនេះថាបានស្កេនចេញរួចរាល់ហើយឬ?
ko: 이 사용자를 체크아웃으로 표시하시겠습니까?

source: Yes, Check Out
km: បាទ/ចាស ស្កេនចេញ
ko: 예, 체크아웃

source: Check-in updated successfully
km: ការផ្លាស់ប្តូរ Status ថាបានស្កេនចូលដោយជោគជ័យ
ko: 체크인이 성공적으로 업데이트되었습니다

source: Check-Out Failed
km: ការផ្លាស់ប្តូរ Status ទៅជាបានស្កេនចេញបានបរាជ័យ
ko: 체크아웃 실패

source: Check-out updated successfully
km: ការផ្លាស់ប្តូរ Status ថាបានស្កេនចេញដោយជោគជ័យ
ko: 체크아웃이 성공적으로 업데이트되었습니다

source: Check-In Failed
km: ការផ្លាស់ប្តូរ Status ទៅជាបានស្កេនចូលបានបរាជ័យ
ko: 체크인 실패

source: Are you sure to delete overtime?
km: តើអ្នកប្រាកដថាចង់លុបម៉ោងបន្ថែមឬ?
ko: 초과 근무를 삭제하시겠습니까?

source: This will delete the overtime record
km: នេះនឹងលុបកំណត់ត្រាម៉ោងបន្ថែម
ko: 이 작업은 초과 근무 기록을 삭제합니다

source: Are you sure to delete permission?
km: តើអ្នកប្រាកដថាចង់លុបការអនុញ្ញាតឬ?
ko: 허가를 삭제하시겠습니까?

source: This will delete the permission record
km: នេះនឹងលុបកំណត់ត្រាការអនុញ្ញាត
ko: 이 작업은 허가 기록을 삭제합니다

source: Are you sure to delete leave request?
km: តើអ្នកប្រាកដថាចង់លុបសំណើឈប់សម្រាកឬ?
ko: 휴가 요청을 삭제하시겠습니까?

source: This will delete the leave request record
km: នេះនឹងលុបកំណត់ត្រាសំណើឈប់សម្រាក
ko: 이 작업은 휴가 요청 기록을 삭제합니다

source: Phone
km: លេខទូរសព្ទ
ko: 전화번호

source: Location
km: ទីតាំង
ko: 위치

source: Jointed
km: បានចុះឈ្មោះ
ko: 참여함

source: Unknown
km: មិនស្គាល់
ko: 알 수 없음

source: Month
km: ខែ
ko: 월

source: Rule Settings
km: ការកំណត់ច្បាប់
ko: 규칙 설정

source: Set Time Settings
km: កំណត់ការកំណត់ពេលវេលា
ko: 시간 설정 구성

source: You can set time settings
km: អ្នកអាចកំណត់ការកំណត់ពេលវេលា
ko: 시간 설정을 구성할 수 있습니다

source: End Time
km: ម៉ោងបញ្ចប់
ko: 종료 시간

source: Break Start
km: ចាប់ផ្តើមពេលសម្រាក
ko: 휴식 시작

source: Break End
km: បញ្ចប់ពេលសម្រាក
ko: 휴식 종료

source: Break Time
km: ពេលវេលាផឹក
ko: 휴식 시간

source: Enable Lunch Break Tracking
km: បើកការតាមដានពេលវេលាអាហារថ្ងៃត្រង់
ko: 점심시간 추적 활성화

source: Save
km: រក្សាទុក
ko: 저장

source: Warning & Alert Settings
km: ការកំណត់ការព្រមាន និងការជូនដំណឹង
ko: 경고 및 알림 설정

source: You can set warning & alert settings
km: អ្នកអាចកំណត់ការព្រមាន និងការជូនដំណឹងបាន
ko: 경고 및 알림 설정을 구성할 수 있습니다

source: Student Warning Thresholds
km: កម្រិតការព្រមានសិស្ស
ko: 학생 경고 임계값

# auto_escalate_warnings_based_on_frequency
source: Automatically escalate warnings based on frequency
km: បង្វិលការព្រមានដោយស្វ័យប្រវត្តិ អាស្រ័យលើប្រេកង់
ko: 빈도에 따라 경고 자동 상향 조정

source: Take a Leave
km: សុំចេញ
ko: 휴가 신청

source: Absent without info
km: អវត្តមានដោយគ្មានព័ត៌មាន
ko: 무단 결석

source: Go Outside
km: ចេញក្រៅ
ko: 외출

source: Set Rules
km: កំណត់ច្បាប់
ko: 규칙 설정

source: You can set your rules
km: អ្នកអាចកំណត់ច្បាប់របស់អ្នកបាន
ko: 규칙을 설정할 수 있습니다

source: Select Generation
km: ជ្រើសរើសជំនាន់
ko: 세대 선택

source: For Student
km: សម្រាប់សិស្ស
ko: 학생용

source: For Staff
km: សម្រាប់បុគ្គលិក
ko: 직원용

source: Add New Rule
km: បន្ថែមច្បាប់ថ្មី
ko: 새 규칙 추가

source: Create New Rule
km: បង្កើតច្បាប់ថ្មី
ko: 새 규칙 만들기

source: Set Overtime Rule
km: កំណត់ច្បាប់ថែមម៉ោង
ko: 초과근무 규칙 설정

source: Add your overtime rule
km: បន្ថែមច្បាប់ថែមម៉ោងរបស់អ្នក
ko: 초과근무 규칙을 추가하세요

source: Set Attendance Rule
km: កំណត់ច្បាប់វត្តមាន
ko: 출석 규칙 설정

source: Delete Rule
km: លុបច្បាប់
ko: 규칙 삭제

# delete_rule_confirmation
source: Are you sure you want to delete this entire rule? This action cannot be undone.
km: តើអ្នកប្រាកដថាចង់លុបច្បាប់ទាំងមូលនេះឬ? សកម្មភាពនេះមិនអាចដកហូតវិញបានទេ។
ko: 이 규칙 전체를 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.

source: Error
ko: 오류

# test
source: Using a few simple prompts, create professional, stylized, and structured documents with images, tables, and more. Get help refining your content, see the latest summary of your work, and ask questions to improve and finalize your document.
ko: 몇 가지 간단한 프롬프트를 사용하여 이미지, 표 등을 포함한 전문적이고 스타일화된 구조화된 문서를 만드세요. 콘텐츠 정제에 도움을 받고, 최신 작업 요약을 확인하고, 문서를 개선하고 마무리하기 위한 질문을 하세요.
